OpenFOAM-v2106/tutorials/multiphase/interCondensatingEvaporatingFoam/condensatingVessel/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [ 1 -1 -2 0 0 0 0 ];

internalField       uniform 1e5;

boundaryField
{
    bottom
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    top
    {
        type            totalPressure;
        p0              $internalField;
    }

    left
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    right
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
